@edwardmedia - I can but I _do_ think this is a bug rather than a feature: a `terraform plan` should _always_ be compatible with `terraform apply`; in normal usage like this, it should never error and surface an API error.  

If the API has an immutable attribute like this, the terraform provider should behave accordingly and indicate in the plan that the resource in question requires recreation.

For example if I were to try to change the name of a GCS bucket, terraform will tell me in the plan :

```tf
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

  # google_storage_bucket.example must be replaced
-/+ resource "google_storage_bucket" "example" {
      ~ bucket_policy_only = false -> (known after apply)
        force_destroy      = false
      ~ id                 = "example" -> (known after apply)
      - labels             = {} -> null
        location           = "EU"
      ~ name               = "example" -> "example-rename" # forces replacement
      ~ project            = "xyz" -> (known after apply)
      - requester_pays     = false -> null
      ~ self_link          = "https://www.googleapis.com/storage/v1/b/example" -> (known after apply)
        storage_class      = "MULTI_REGIONAL"
      ~ url                = "gs://example" -> (known after apply)
    }
```

See also examples in Hashicorp documentation:

- https://www.hashicorp.com/blog/zero-downtime-updates-with-terraform/#problem-1-how-to-ensure-new-infrastructure-is-created-before-the-old-is-destroyed
- https://learn.hashicorp.com/terraform/getting-started/change#apply-changes
